Line Level Security

- Minimal password security can be configured at three different levels, through the use of locally defined passwords
  - Console Line: Access to User Exec mode via a console cable
  - VTY Line: Accessing User Exec mode via a remote protocol such as Telnet or SSH
  - Privileged Exec Mode: Entering the "enable" command
- All three can be used or a combination of one or more

# Line Console Password Configuration

      router#conf t
      router(config)#line console 0
      router(config-line)#password <PASSWORD>
      router(config-line)#login
  
# VTY (Telnet) Password Configuration

- If this is a Layer 2 switch, remember to configure a Management IP and set the default gateway

      switch#conf t
      switch(config)#interface vlan 1
      switch(config-if)#ip add <ADDRESS> <SUBNET MASK>
      switch(config-if)#no shutdown
      switch(config-if)#exit
      switch(config)#ip default-gateway <GATEWAY IP>
  
  - You can now configure Telnet

      switch(config)#line vty 0 15
      switch(config-line)#password <PASSWORD>
      switch(config-line)#login

# Securing VTY Lines with an ACL

  - This adds yet another level of security so only certain workstations can connect

      switch(config)#access-list 1 permit <HOST IP>
      switch(config)#line vty 0 15
      switch(config-line)#password <PASSWORD>
      switch(config-line)#login
      switch(config-line)#access-list 1 in
      
# Securing the Privilege Exec Mode

- A basic way to set a password to access the Privilege Exec is like so

      switch#conf t
      switch(config)#enable password <PASSWORD>
      
- Now when a new connection moved from User mode to User Exec mode using the "enable" command they will be prompted for the password
- The issue with this process is that the password we set is stored in the running-configuration file in plain view
- We can perform the same action, but instead hash our password so it is unreadable in the running-configuration file

      switch#en
      switch(config)#enable secret <PASSWORD>
      
- At this point if we viewed the running-configuration file we would see that only the "secret" enable password is encrypted, both the Console and VTY line level
  passwords are also in plain text, however we can encrypt both of these also
  
      switch#conf t
      switch(config)#service password-encryption
      

      
      
