Port Security

- Shutdown any unused interfaces
- With Port Security we can define whch host or hosts are allowed to send traffic in to a switch port based on their MAC address, this allows an interface to be
  locked down to a particular host or hosts
- If traffic comes in to the switch port with a MAC address that is not allowed the switch will drop the traffic
- It is easy to spoof a MAC address so this is not Port Securities main function
- We can also configure the switch port to only allow a certain number of MAC address, this is useful as it prevents unauthorised access points being connected to
  a switch port and multiple devices then connecting to the network over the interface
- To enable port-security on a switch port, the port must be an Access Port, by default the ports are "dynamic"

### Configuration

switch#conf t
switch(config)#interface fa0/2
switch(config-if)#switchport mode access
switch(config-if)#switchport port-security

- This is default configuration, only one MAC address can be used on the interface at one time
- It is not locked down to only 1 specific MAC address however
- If multiple hosts try to connect over the interface via another switch or an Access Point, the port will be shutdown

### Verification

switch#show port-security interface fa0/2

### Violation Modes

- Shutdown (default); Interface is placed in to an err-disabled state, blocking all traffic, remove the MAC address and flap the port to bring it back up
- Protect: Traffic from unauthorised MAC addresses is blocked, traffic from authorised MAC address is allowed
- Restrict: Traffic from unauthorsed MAC addresses is dropped, logged and the violation counter in the output of the verification command is incremented. Traffic
            from allowed MAC addresses is forwarded
            
### Violation Mode Configuration

switch#conf t
switch(config)#interface fa0/2
switch(config-if)#switchport port-security violation [protect | restrict]

### Auto-Recovery

- We can bring an interface back from an err-disabled state by removing the offending MAC address and flapping the port, but this can be configured automatically
- We just need to configure a time period that the port needs to wait before coming back up

  switch#conf t
  switch(config)#errdisable recovery cause psecure-violation
  switch(config)#errdisable recovery interval 600
  
### Maximum allowed MAC Address

- When we enable port-security on a switchport interface, the default number of allowed MAC addresses is 1
- We can increase this, say to 2 MAC addresses if we have a PC plugged in to an IPhone which is then plugged in to the switch

  switch#conf t
  switch(config)#interface fa0/1
  switch(config-if)#switchport mode access
  switch(config-if)#switchport port-security maximum 2
  
### Lock interface down to a specific MAC Address

- We can manually configure the allowed MAC addresses on an interface to a specific MAC address only

  switch#conf t
  switch(config)#interface fa0/1
  switch(config-if)#switchport mode access
  switch(config-if)#switchport port-security
  switch(config-if)#switchport port-security mac-address AAAA:BBBB:CCCC
  switch(config-if)#switchport port-security maximum 1
  
- This is not very scalable, imagine we have a large amount of authorised PCs and we want to lock the switchports down to only these allowed hosts
- In this scenario we can use Stciky MAC Addresses
- Sticky MAC Addresses add te learned MAC address to the running configuration and save to the startup configuration to make them permanent

  switch#conf t
  switch(config)#interface fa0/1
  switch(config-if)#switchport mode access
  switch(config-if)#switchport port-security
  switch(config-if)#switchport port-security mac-address sticky
  
### Verification

  switch#show port-security address       <- View MAC addresses on each interface and whether dynamically learned or statically configured
  switch#show port-security               <- Get information/statistics on each interface the port-security has been enabled on
  
